plat-portal-api/app/payments/tests/fake_data/app_MW/subscription_data.json

{
  "application_fee_percent": null,
  "billing_cycle_anchor": 1623226816,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1623226816,
  "current_period_end": 1625818816,
  "current_period_start": 1623226816,
  "customer": "cus_JNBsN0sJoCPAic",
  "days_until_due": null,
  "default_payment_method": "pm_1IkRUpBhZLR2oJFV2UWAgmpH",
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": null,
  "id": "sub_JRjzP3sflZEPJZ",
  "items": {
    "data": [
      {
        "billing_thresholds": null,
        "created": 1623226816,
        "id": "si_Jddv5jtKmxgdVY",
        "metadata": {},
        "object": "subscription_item",
        "plan": {
          "active": true,
          "aggregate_usage": null,
          "amount": 1000,
          "amount_decimal": "1000",
          "billing_scheme": "per_unit",
          "created": 1615796236,
          "currency": "usd",
          "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "object": "plan",
          "product": "prod_J7QStGwMYujgnp",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1615796236,
          "currency": "usd",
          "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_J7QStGwMYujgnp",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 1000,
          "unit_amount_decimal": "1000"
        },
        "quantity": 1,
        "subscription": "sub_JddvD38NtyYQlw",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "object": "list",
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_JddvD38NtyYQlw"
  },
  "latest_invoice": "in_1J0Me4BhZLR2oJFVKqyc0Pmk",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "object": "subscription",
  "pause_collection": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "active": true,
    "aggregate_usage": null,
    "amount": 1000,
    "amount_decimal": "1000",
    "billing_scheme": "per_unit",
    "created": 1615796236,
    "currency": "usd",
    "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": null,
    "object": "plan",
    "product": "prod_J7QStGwMYujgnp",
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1623226816,
  "status": "active",
  "transfer_data": null,
  "trial_end": null,
  "trial_start": null
}