plat-portal-api/app/payments/tests/fake_data/app_MW/webhook_customer.subscription.updated.json

{
  "type": "customer.subscription.updated",
  "data": {
    "object": {
      "id": "sub_JRjzP3sflZEPJZ",
      "plan": {
        "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
        "active": true,
        "amount": 1000,
        "object": "plan",
        "created": 1615796236,
        "product": "prod_J7QStGwMYujgnp",
        "currency": "usd",
        "interval": "month",
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "tiers_mode": null,
        "usage_type": "licensed",
        "amount_decimal": "1000",
        "billing_scheme": "per_unit",
        "interval_count": 1,
        "aggregate_usage": null,
        "transform_usage": null,
        "trial_period_days": null
      },
      "items": {
        "url": "/v1/subscription_items?subscription=sub_JRjzP3sflZEPJZ",
        "data": [
          {
            "id": "si_JRjz9SkzUm0rdo",
            "plan": {
              "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
              "active": true,
              "amount": 1000,
              "object": "plan",
              "created": 1615796236,
              "product": "prod_J7QStGwMYujgnp",
              "currency": "usd",
              "interval": "month",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "tiers_mode": null,
              "usage_type": "licensed",
              "amount_decimal": "1000",
              "billing_scheme": "per_unit",
              "interval_count": 1,
              "aggregate_usage": null,
              "transform_usage": null,
              "trial_period_days": null
            },
            "price": {
              "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
              "type": "recurring",
              "active": true,
              "object": "price",
              "created": 1615796236,
              "product": "prod_J7QStGwMYujgnp",
              "currency": "usd",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "recurring": {
                "interval": "month",
                "usage_type": "licensed",
                "interval_count": 1,
                "aggregate_usage": null,
                "trial_period_days": null
              },
              "lookup_key": null,
              "tiers_mode": null,
              "unit_amount": 1000,
              "billing_scheme": "per_unit",
              "transform_quantity": null,
              "unit_amount_decimal": "1000"
            },
            "object": "subscription_item",
            "created": 1620481645,
            "metadata": {},
            "quantity": 1,
            "tax_rates": [],
            "subscription": "sub_JRjzP3sflZEPJZ",
            "billing_thresholds": null
          }
        ],
        "object": "list",
        "has_more": false,
        "total_count": 1
      },
      "object": "subscription",
      "status": "active",
      "created": 1620481644,
      "customer": "cus_JNBsN0sJoCPAic",
      "discount": null,
      "ended_at": null,
      "livemode": false,
      "metadata": {},
      "quantity": 1,
      "schedule": null,
      "cancel_at": null,
      "trial_end": null,
      "start_date": 1620481644,
      "canceled_at": null,
      "trial_start": null,
      "transfer_data": null,
      "days_until_due": null,
      "default_source": null,
      "latest_invoice": "in_1IoqV6BhZLR2oJFVVIQNXEHR",
      "pending_update": null,
      "pause_collection": null,
      "collection_method": "charge_automatically",
      "default_tax_rates": [],
      "billing_thresholds": null,
      "current_period_end": 1623160044,
      "billing_cycle_anchor": 1620481644,
      "cancel_at_period_end": false,
      "current_period_start": 1620481644,
      "pending_setup_intent": null,
      "default_payment_method": "pm_1IkRUpBhZLR2oJFV2UWAgmpH",
      "application_fee_percent": null,
      "pending_invoice_item_interval": null,
      "next_pending_invoice_item_invoice": null
    }
  }
}