plat-portal-api/app/payments/tests/fake_data/app_MW/webhook_invoice.payment_failed.json

{
  "type": "invoice.payment_failed",
  "data": {
    "object": {
      "id": "in_1Jc0LmBhZLR2oJFVLnO5sFzL",
      "object": "invoice",
      "account_country": "US",
      "account_name": "CBPO DEV",
      "account_tax_ids": null,
      "amount_due": 2000,
      "amount_paid": 0,
      "amount_remaining": 2000,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "manual",
      "charge": "ch_3Jc0LoBhZLR2oJFV0cCaoQn9",
      "collection_method": "charge_automatically",
      "created": 1632197578,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_JNBsN0sJoCPAic",
      "customer_address": null,
      "customer_email": null,
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": "(created by Stripe CLI)",
      "discount": null,
      "discounts": [
      ],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1IVAuQBhZLR2oJFV/invst_KGXQ1YpBHaKXPs7HahztTClghCh1j7K",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1IVAuQBhZLR2oJFV/invst_KGXQ1YpBHaKXPs7HahztTClghCh1j7K/pdf",
      "last_finalization_error": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1Jc0LmBhZLR2oJFV8i7WuYzX",
            "object": "line_item",
            "amount": 2000,
            "currency": "usd",
            "description": "(created by Stripe CLI)",
            "discount_amounts": [
            ],
            "discountable": true,
            "discounts": [
            ],
            "invoice_item": "ii_1Jc0LmBhZLR2oJFVzC8GjiyH",
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": 1632197578,
              "start": 1632197578
            },
            "plan": null,
            "price": {
              "id": "price_1Jc0LmBhZLR2oJFVrjr5jkaq",
              "object": "price",
              "active": false,
              "billing_scheme": "per_unit",
              "created": 1632197578,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_KGXQl3kT1chDOd",
              "recurring": null,
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "one_time",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_JRjzP3sflZEPJZ",
            "tax_amounts": [
            ],
            "tax_rates": [
            ],
            "type": "invoiceitem"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1Jc0LmBhZLR2oJFVLnO5sFzL/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "7D76837B-0001",
      "on_behalf_of": null,
      "paid": false,
      "payment_intent": "pi_3Jc0LoBhZLR2oJFV0yFKvZUE",
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1632197578,
      "period_start": 1632197578,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "open",
      "status_transitions": {
        "finalized_at": 1632197579,
        "marked_uncollectible_at": null,
        "paid_at": null,
        "voided_at": null
      },
      "subscription": "sub_JRjzP3sflZEPJZ",
      "subtotal": 2000,
      "tax": null,
      "total": 2000,
      "total_discount_amounts": [
      ],
      "total_tax_amounts": [
      ],
      "transfer_data": null,
      "webhooks_delivered_at": 1632197579
    }
  }
}