plat-portal-api/app/payments/tests/fake_data/app_MW/webhook_invoice.upcoming.json

{
  "type": "invoice.upcoming",
  "data": {
    "object": {
      "tax": null,
      "paid": false,
      "lines": {
        "url": "/v1/invoices/upcoming/lines?customer=cus_JCf6hKS9LYv36q&subscription=sub_JCf6mixkJWTBiW",
        "data": [
          {
            "id": "il_tmp_1d8e25HyAWuXGp9N1a3a28ec",
            "plan": {
              "id": "price_1IY5QrHyAWuXGp9Nv4lhvIIW",
              "active": true,
              "amount": 24900,
              "object": "plan",
              "created": 1616487465,
              "product": "prod_JAQHyitOFauFFw",
              "currency": "usd",
              "interval": "month",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "tiers_mode": null,
              "usage_type": "licensed",
              "amount_decimal": "24900",
              "billing_scheme": "per_unit",
              "interval_count": 1,
              "aggregate_usage": null,
              "transform_usage": null,
              "trial_period_days": null
            },
            "type": "subscription",
            "price": {
              "id": "price_1IY5QrHyAWuXGp9Nv4lhvIIW",
              "type": "recurring",
              "active": true,
              "object": "price",
              "created": 1616487465,
              "product": "prod_JAQHyitOFauFFw",
              "currency": "usd",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "recurring": {
                "interval": "month",
                "usage_type": "licensed",
                "interval_count": 1,
                "aggregate_usage": null,
                "trial_period_days": null
              },
              "lookup_key": null,
              "tiers_mode": null,
              "unit_amount": 24900,
              "billing_scheme": "per_unit",
              "transform_quantity": null,
              "unit_amount_decimal": "24900"
            },
            "amount": 24900,
            "object": "line_item",
            "period": {
              "end": 1622447088,
              "start": 1619768688
            },
            "currency": "usd",
            "livemode": false,
            "metadata": {},
            "quantity": 1,
            "discounts": [],
            "proration": false,
            "tax_rates": [],
            "description": "1 × Standard (at $249.00 / month)",
            "tax_amounts": [],
            "discountable": true,
            "subscription": "sub_JCf6mixkJWTBiW",
            "discount_amounts": [],
            "subscription_item": "si_JCf6R6xwK20zt4"
          }
        ],
        "object": "list",
        "has_more": false,
        "total_count": 1
      },
      "total": 24900,
      "charge": null,
      "footer": null,
      "number": null,
      "object": "invoice",
      "status": "draft",
      "created": 1619768688,
      "currency": "usd",
      "customer": "cus_JCf6hKS9LYv36q",
      "discount": null,
      "due_date": null,
      "livemode": false,
      "metadata": {},
      "subtotal": 24900,
      "attempted": false,
      "discounts": [],
      "amount_due": 24900,
      "period_end": 1619768688,
      "amount_paid": 0,
      "description": null,
      "account_name": "CBPO QA Test",
      "on_behalf_of": null,
      "period_start": 1617176688,
      "subscription": "sub_JRjzP3sflZEPJZ",
      "attempt_count": 0,
      "custom_fields": null,
      "customer_name": null,
      "transfer_data": null,
      "billing_reason": "upcoming",
      "customer_email": "hung.nguyenminh@hdwebsoft.co",
      "customer_phone": null,
      "default_source": null,
      "ending_balance": 0,
      "payment_intent": null,
      "receipt_number": null,
      "account_country": "US",
      "account_tax_ids": null,
      "amount_remaining": 24900,
      "customer_address": null,
      "customer_tax_ids": [],
      "payment_settings": {
        "payment_method_types": null,
        "payment_method_options": null
      },
      "starting_balance": 0,
      "collection_method": "charge_automatically",
      "customer_shipping": null,
      "default_tax_rates": [],
      "total_tax_amounts": [],
      "status_transitions": {
        "paid_at": null,
        "voided_at": null,
        "finalized_at": null,
        "marked_uncollectible_at": null
      },
      "customer_tax_exempt": "none",
      "next_payment_attempt": 1619772288,
      "statement_descriptor": null,
      "webhooks_delivered_at": null,
      "application_fee_amount": null,
      "default_payment_method": null,
      "total_discount_amounts": [],
      "last_finalization_error": null,
      "pre_payment_credit_notes_amount": 0,
      "post_payment_credit_notes_amount": 0
    }
  }
}